# =================================================================================================== #
# Для расчетов 
import numpy as np

# =================================================================================================== #
# Класс для хранения информации о функции

class file_info:
  def __init__(self, X = None, Y = None, f = None, x0 = None):
    self.X = X
    self.Y = Y
    self.Z = np.vectorize(lambda x, y: f(np.array([x, y])))(X, Y)
    self.f = f
    self.x0 = x0

# =================================================================================================== #
